ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf7140_secure</name>
  <series>nRF71</series>
  <version>1</version>
  <description>nRF7140 is an ultra-low power multi-core System on Chip (SoC)</description>
  <licenseText>
Copyright (c) 2010 - 2024, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>480</deviceNumInterrupts>
    <sauNumRegions>8</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf7140_secure</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>480</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>ICACHEDATA_S</name>
      <description>CACHEDATA</description>
      <baseAddress>0x01F00000</baseAddress>
      <headerStructName>ICACHEDATA</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ICACHEDATA</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>512</dim>
          <dimIncrement>0x040</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ICACHEDATA_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>ICACHEDATA_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <dim>4</dim>
              <dimIncrement>0x008</dimIncrement>
              <name>DU[%s]</name>
              <description>Unspecified</description>
              <headerStructName>ICACHEDATA_SET_WAY_DU</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DATA[%s]</name>
                <description>Description collection: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o].</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>Data</name>
                    <description>Data</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <access>read-only</access>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>ICACHEINFO_S</name>
      <description>CACHEINFO</description>
      <baseAddress>0x01F10000</baseAddress>
      <headerStructName>ICACHEINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ICACHEINFO</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>512</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ICACHEINFO_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x004</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>ICACHEINFO_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <register>
              <name>INFO</name>
              <description>Description cluster: Cache information for SET[n], WAY[o].</description>
              <addressOffset>0x0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAG</name>
                  <description>Cache tag.</description>
                  <lsb>0</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DUV_0</name>
                  <description>Data unit valid info.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_1</name>
                  <description>Data unit valid info.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_2</name>
                  <description>Data unit valid info.</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_3</name>
                  <description>Data unit valid info.</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D0</name>
                  <description>Dirty status of combined data unit 0 and 1.</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D1</name>
                  <description>Dirty status of combined data unit 2 and 3.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>V</name>
                  <description>Line valid bit.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid cache line</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid cache line</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MRU</name>
                  <description>Most recently used way.</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Way0</name>
                      <description>Way0 was most recently used</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Way1</name>
                      <description>Way1 was most recently used</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
