ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
          <cluster>
            <name>UPDATE</name>
            <description>Description of FW Updates, if any.
        In case, SICR.UROT.TBS.POLICY.UPDATE is set to Disabled,
        these registers are ignored by the secure domain ROM code.</description>
            <headerStructName>SICR_UROT_UPDATE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0200</addressOffset>
            <register>
              <name>OPERATION</name>
              <description>Command from the secure domain firmware to the secure domain ROM code.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OPCODE</name>
                  <description>Opcode to identify the command.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Nop</name>
                      <description>No operation pending.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTVerify</name>
                      <description>Command to only verify UROT (plain-text or encrypted) firmware
                update without applying it.</description>
                      <value>0x80000001</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTActivate</name>
                      <description>Command to verify and update encrypted UROT firmware.</description>
                      <value>0x80000002</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryVerify</name>
                      <description>Command to verify the recovery (plain-text only) firmware update
                without applying it.</description>
                      <value>0x80000003</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryActivate</name>
                      <description>Command to verify and update plain-text Recovery firmware.</description>
                      <value>0x80000004</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTPlainTextActivate</name>
                      <description>Command to verify and update plain-text UROT firmware.</description>
                      <value>0x80000005</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AROTRecovery</name>
                      <description>Instructs the ROM code to boot the recovery image in safe mode
                to download a AROT image instead of a UROT image.</description>
                      <value>0xA0000001</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>ROM code indicates the status of update to the secure
            domain firmware via this register.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CODE</name>
                  <description>Status code.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>None</name>
                      <description>No operation pending to indicate any status.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UnknownOperation</name>
                      <description>Unknown OPCODE in SICR.UROT.UPDATE.OPERATION.</description>
                      <value>0xF0000001</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>InvalidManifest</name>
                      <description>The information in the manifest is invalid.</description>
                      <value>0xF0000002</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>StaleFW</name>
                      <description>The timestamp on the firmware is older than the current one.</description>
                      <value>0xF0000003</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VerifyFailure</name>
                      <description>The signature did not verify.</description>
                      <value>0xF0000005</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VerifyOK</name>
                      <description>Signature verification is successful.</description>
                      <value>0xF0000006</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTUpdateDisabled</name>
                      <description>UROT firmware update is disabled via policy.</description>
                      <value>0xF0000007</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTActivated</name>
                      <description>UROT firmware update verification and installation succeeded.</description>
                      <value>0xF0000008</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryActivated</name>
                      <description>Recovery firmware update verification and installation succeeded.</description>
                      <value>0xF0000009</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryUpdateDisabled</name>
                      <description>Recovery update is disabled via policy.</description>
                      <value>0xF000000A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AROTRecovery</name>
                      <description>Recovery image is booted so that the recovery image can download a
                AROT image that ROM does not verify.</description>
                      <value>0xF1000000</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <cluster>
              <name>DOWNLOAD</name>
              <description>Information about downloaded firmware update. The addresses described here
            are the location of the update and not the location they must be installed.
            The installation information is described in the signed manifest.</description>
              <headerStructName>SICR_UROT_UPDATE_DOWNLOAD</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0008</addressOffset>
              <register>
                <name>FW</name>
                <description>Location for the firmware update to be installed.</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ADDR</name>
                    <description>The MRAM Location of the firmware to be installed. This is not
                the  same as the address in the signed manifest. The signed
                manifest contains the target location where the firmware must
                be installed, not the current location where it is downloaded.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unprogrammed</name>
                        <description>The signature is not programmed.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>PUBKEY</name>
                <description>Location of the public key to verify the signature on the firmware update.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ADDR</name>
                    <description>MRAM Location for the signature on the firmware update.
                This is not the same as the address in the signed manifest. The
                signed manifest contains the target location where the public
                key must be kept once the update is installed, not the current
                location where it is downloaded.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unprogrammed</name>
                        <description>The signature is not programmed.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>SIGNATURE</name>
                <description>Location for the signature on the firmware update to be verified
               before the update is installed.</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ADDR</name>
                    <description>MRAM Location for the signature on the firmware update.
                This is not the same as the address in the signed manifest.
                The signed manifest contains the target location where the
                signature must be kept once the update is installed, not the
                current location where it is downloaded.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unprogrammed</name>
                        <description>The signature is not programmed.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>MAX</name>
                <description>Max Size of the download.</description>
                <addressOffset>0x000C</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SIZE</name>
                    <description>Max size of the downloaded firmware update. This define is
                ignored during update of UROT or the recovery image since the
                signed manifest contains the needed sizes. This field is used to
                define the writable MRAM region when the recovery image is
                started in  the safe mode.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unprogrammed</name>
                        <description>The signature is not programmed.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>SM</name>
              <description>Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.</description>
              <headerStructName>SICR_UROT_UPDATE_SM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0020</addressOffset>
              <cluster>
                <name>TBS</name>
                <description>Manifest describing the secure domain firmware.
          The secure domain ROM code verifies the signature on the digest of this register.</description>
                <headerStructName>SICR_UROT_UPDATE_SM_TBS</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0000</addressOffset>
                <cluster>
                  <name>PUBKEY</name>
                  <description>Raw public key used to verify the signed manifest.</description>
                  <headerStructName>SICR_UROT_UPDATE_SM_TBS_PUBKEY</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0000</addressOffset>
                  <register>
                    <name>SIZE</name>
                    <description>The size of the raw public key(in bytes).</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Key size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The key is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>SizeEd25519</name>
                            <description>The size of the raw Ed25519 public key.
                  Currently this is the only size supported by the secure domain ROM code.</description>
                            <value>0x00000020</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the raw public key.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Public key address.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The key is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>LAYOUT</name>
                  <description>The MRAM layout of UROT firmware and the recovery image.</description>
                  <headerStructName>SICR_UROT_UPDATE_SM_TBS_LAYOUT</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0008</addressOffset>
                  <cluster>
                    <name>USLOT</name>
                    <description>Start adddress and max size of UROT slot (USLOT), Shall remain the same for firmware
               updates once programmed or unless transitioned back to LCS Empty.</description>
                    <headerStructName>SICR_UROT_UPDATE_SM_TBS_LAYOUT_USLOT</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0000</addressOffset>
                    <register>
                      <name>START</name>
                      <description>Start address of the UROT firmware. Shall not overlap with the recovery slot (RSLOT).</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>MAX</name>
                      <description>Maximum size of the UROT firmware in bytes.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <cluster>
                    <name>RSLOT</name>
                    <description>Start adddress and max size of recovery slot (RSLOT), Shall remain the same for
                firmware updates once programmed or unless transitioned back to LCS Empty.</description>
                    <headerStructName>SICR_UROT_UPDATE_SM_TBS_LAYOUT_RSLOT</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0008</addressOffset>
                    <register>
                      <name>START</name>
                      <description>Start address of the recovery firmware. Shall not overlap with the UROT slot(USLOT).</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>MAX</name>
                      <description>Maximum size of the recovery image in bytes.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                </cluster>
                <cluster>
                  <name>FW</name>
                  <description>FW verified by the secure domain ROM code.</description>
                  <headerStructName>SICR_UROT_UPDATE_SM_TBS_FW</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0018</addressOffset>
                  <register>
                    <name>SIZE</name>
                    <description>The firmware size (in bytes). Shall not exceed the max defined
              limits for USLOT in case of UROT firmware.Shall not exceed the max
              defined limits for USLOT in case of UROT firmware.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Firmware size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the firmware verified by the secure domain
              ROM code.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Firmware address</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
