ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
                  <register>
                    <dim>0x10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>DIGEST[%s]</name>
                    <description>Description collection: SHA2-512 digest of the firmware.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>SHA2-512 Digest value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW digest, and hence the FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>VERSION[%s]</name>
                    <description>Description collection: 128-bit revision of the firmware; can be left Unprogrammed.</description>
                    <addressOffset>0x0048</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>nth word of the version.</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>TIMESTAMP</name>
                    <description>Unsigned 32-bit integer timestamp of the firmware in Unix time used to prevent
               downgrade of firmware on firmware update.</description>
                    <addressOffset>0x0058</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Unsigned unix-time timestamp of the firmware</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW timestamp is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>PARTNO</name>
                    <description>Part-number for which the firmware is built. Must match
               the part number in OICR region.</description>
                    <addressOffset>0x005C</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Part number of the device for which the firmware is built.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The part number is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>POLICY</name>
                  <description>Set various policies on related to the firmware verification and
            update.</description>
                  <headerStructName>SICR_UROT_UPDATE_SM_TBS_POLICY</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0078</addressOffset>
                  <register>
                    <name>UPDATE</name>
                    <description>Enable or Disable firmware update.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on update is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable firmware update.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable firmware update.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>REVOKE</name>
                    <description>Configure key revocation policy.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                   on auto-revocation is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable auto-revocation of keys.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable auto-revocation of keys used to verify firmware.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>DGPREV</name>
                    <description>Configure the downgrade prevention policy.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable downgrade protection on firmware update.
                  If Enabled, the SM.TBS.FW.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SM.TBS.FW.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SM.</description>
                    <addressOffset>0x000C</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <register>
                  <dim>0x10</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>CIPHERDIGEST[%s]</name>
                  <description>Description collection: SHA2-512 digest of the AES-GCM AAD, IV and encrypted firmware.</description>
                  <addressOffset>0x0098</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>SHA2-512 Digest value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>Encrypted firmware digest, unprogrammed if the FW is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>RFU[%s]</name>
                  <description>Description collection: These registers are included when generating signature of the TBS content of SM</description>
                  <addressOffset>0x00D8</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>RFU</name>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The register is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>SIGNATURE</name>
                <description>Signature on the manifest defined in TBS</description>
                <headerStructName>SICR_UROT_UPDATE_SM_SIGNATURE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x00F4</addressOffset>
                <register>
                  <name>ALG</name>
                  <description>The signature algorithm identifier as defined in RFC8152.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>ID</name>
                      <description>Algorithm identifier</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature algorithm identifier is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>AlgIdEd25519</name>
                          <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                          <value>0x00000005</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>SIZE</name>
                  <description>Size of the raw signature in bytes.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Signature size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>Size of Ed25519 signature bytestring.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>MaxSize</name>
                          <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the signature on the firmware manifest.</description>
                  <addressOffset>0x0008</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Signature address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <register>
            <dim>0x400</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CERTIFICATE[%s]</name>
            <description>Description collection: Device X.509 certificate.</description>
            <addressOffset>0x0320</addressOffset>
            <access>read-write</access>
            <size>0x20</size>
            <fields>
              <field>
                <name>CERT</name>
                <description>Device certificate.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>AROT</name>
          <description>Interface used by the secure domain firmware to extend the RoT to the
      other local domains and store information on configuration of debug
      access ports, CTRL-AP methods, and other platfrom security related
      configurations per domain.
      These registers are only accessed the secure domain firmware.
      Any operations related to the local domains must be requested
      via the secure domain firmware API.</description>
          <headerStructName>SICR_AROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1500</addressOffset>
          <cluster>
            <name>SECURE</name>
            <description>Unspecified</description>
            <headerStructName>SICR_AROT_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0000</addressOffset>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x060</dimIncrement>
              <name>OEMPUBKEY[%s]</name>
              <description>The public key used by the top level SUIT manifest. The public key is stored as additional authenticated data (AAD) in unencrypted form using an AEAD scheme realized by AES-256 GCM mode,
      with the secure domain KEK used as a secret key.
      The initialization vector is provided in NONCE register.
      Key attributes from ATTR register shall be used as an additional authenticated data (AAD) in AEAD.
      The content of PUBKEY registers shall be used as an additional authenticated data (AAD) in AEAD.</description>
              <headerStructName>SICR_AROT_SECURE_OEMPUBKEY</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <register>
                <name>NONCE</name>
                <description>Description cluster: The initialization vector of the encryption algorithm used to protect the top level SUIT manifest public key generation [n].</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value of nonce used by AEAD.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>ATTR</name>
                <description>Description cluster: The attributes of the local domain firmware master encryption key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>TYPE</name>
                    <description>Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1.</description>
                    <lsb>0</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>LEN</name>
                    <description>Length of the key in bits.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>PUBKEY[%s]</name>
                <description>Description collection: The top level SUIT manifest public key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key value [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>MAC[%s]</name>
                <description>Description collection: The authentication tag of the top level SUIT manifest public key generation [n].</description>
                <addressOffset>0x0048</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>The word [o] of the authentication tag.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0058</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [o].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
