ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
                  <register>
                    <dim>0x5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SM.</description>
                    <addressOffset>0x000C</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <register>
                  <dim>0x10</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>CIPHERDIGEST[%s]</name>
                  <description>Description collection: SHA2-512 digest of the AES-GCM AAD, IV and encrypted firmware.</description>
                  <addressOffset>0x0098</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>SHA2-512 Digest value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>Encrypted firmware digest, unprogrammed if the FW is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>RFU[%s]</name>
                  <description>Description collection: These registers are included when generating signature of the TBS content of SM</description>
                  <addressOffset>0x00D8</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>RFU</name>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The register is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>SIGNATURE</name>
                <description>Signature on the manifest defined in TBS</description>
                <headerStructName>RICR_UROT_SMWD_SM_SIGNATURE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x00F4</addressOffset>
                <register>
                  <name>ALG</name>
                  <description>The signature algorithm identifier as defined in RFC8152.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>ID</name>
                      <description>Algorithm identifier</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature algorithm identifier is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>AlgIdEd25519</name>
                          <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                          <value>0x00000005</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>SIZE</name>
                  <description>Size of the raw signature in bytes.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Signature size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>Size of Ed25519 signature bytestring.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>MaxSize</name>
                          <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the signature on the firmware manifest.</description>
                  <addressOffset>0x0008</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Signature address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <register>
              <dim>0x10</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: SHA-512 Digest of the signed manifest used for intregrity check of the
          signed-manifest. Utilized in scenarios involving warm-boot and
          firmware update.</description>
              <addressOffset>0x0100</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
            </register>
          </cluster>
          <cluster>
            <name>OWNER</name>
            <description>Unspecified</description>
            <headerStructName>RICR_UROT_OWNER</headerStructName>
            <access>read-write</access>
            <addressOffset>0x01F8</addressOffset>
            <register>
              <name>UROT</name>
              <description>Indicates the owner of UROT firmware.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OWNER</name>
                  <description>Indicates whether UROT owner is uninitialized, Nordic or User.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Uninitialized</name>
                      <description>Owner is not initialized yet.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Nordic</name>
                      <description>Owner is Nordic.</description>
                      <value>0xFD3D8E75</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>User</name>
                      <description>Owner is customer(User).</description>
                      <value>0x67CA0593</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RECOVERY</name>
              <description>Indicates the owner of Recovery firmware.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OWNER</name>
                  <description>Indicates whether Recovery owner is uninitialized, Nordic or User.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Uninitialized</name>
                      <description>Owner is not initialized yet.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Nordic</name>
                      <description>Owner is Nordic.</description>
                      <value>0xFD3D8E75</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>User</name>
                      <description>Owner is customer(User).</description>
                      <value>0x67CA0593</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>RECOVERY</name>
            <description>Unspecified</description>
            <headerStructName>RICR_UROT_RECOVERY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0200</addressOffset>
            <cluster>
              <name>SMWD</name>
              <description>Signed Manifest verified by the secure domain ROM Code to establish the
        primary RoT with digest.</description>
              <headerStructName>RICR_UROT_RECOVERY_SMWD</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <cluster>
                <name>SM</name>
                <description>Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.</description>
                <headerStructName>RICR_UROT_RECOVERY_SMWD_SM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0000</addressOffset>
                <cluster>
                  <name>TBS</name>
                  <description>Manifest describing the secure domain firmware.
          The secure domain ROM code verifies the signature on the digest of this register.</description>
                  <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0000</addressOffset>
                  <cluster>
                    <name>PUBKEY</name>
                    <description>Raw public key used to verify the signed manifest.</description>
                    <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_PUBKEY</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0000</addressOffset>
                    <register>
                      <name>SIZE</name>
                      <description>The size of the raw public key(in bytes).</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <description>Key size</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The key is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>SizeEd25519</name>
                              <description>The size of the raw Ed25519 public key.
                  Currently this is the only size supported by the secure domain ROM code.</description>
                              <value>0x00000020</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>ADDR</name>
                      <description>Address of the raw public key.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <description>Public key address.</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The key is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <cluster>
                    <name>LAYOUT</name>
                    <description>The MRAM layout of UROT firmware and the recovery image.</description>
                    <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0008</addressOffset>
                    <cluster>
                      <name>USLOT</name>
                      <description>Start adddress and max size of UROT slot (USLOT), Shall remain the same for firmware
               updates once programmed or unless transitioned back to LCS Empty.</description>
                      <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_USLOT</headerStructName>
                      <access>read-write</access>
                      <addressOffset>0x0000</addressOffset>
                      <register>
                        <name>START</name>
                        <description>Start address of the UROT firmware. Shall not overlap with the recovery slot (RSLOT).</description>
                        <addressOffset>0x0000</addressOffset>
                        <access>read-write</access>
                        <size>0x20</size>
                        <fields>
                          <field>
                            <name>ADDR</name>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <enumeratedValues>
                              <enumeratedValue>
                                <name>Undefined</name>
                                <description>The slot is not defined.</description>
                                <value>0xFFFFFFFF</value>
                              </enumeratedValue>
                            </enumeratedValues>
                          </field>
                        </fields>
                      </register>
                      <register>
                        <name>MAX</name>
                        <description>Maximum size of the UROT firmware in bytes.</description>
                        <addressOffset>0x0004</addressOffset>
                        <access>read-write</access>
                        <size>0x20</size>
                        <fields>
                          <field>
                            <name>SIZE</name>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <enumeratedValues>
                              <enumeratedValue>
                                <name>Undefined</name>
                                <description>The slot is not defined.</description>
                                <value>0xFFFFFFFF</value>
                              </enumeratedValue>
                            </enumeratedValues>
                          </field>
                        </fields>
                      </register>
                    </cluster>
                    <cluster>
                      <name>RSLOT</name>
                      <description>Start adddress and max size of recovery slot (RSLOT), Shall remain the same for
                firmware updates once programmed or unless transitioned back to LCS Empty.</description>
                      <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_LAYOUT_RSLOT</headerStructName>
                      <access>read-write</access>
                      <addressOffset>0x0008</addressOffset>
                      <register>
                        <name>START</name>
                        <description>Start address of the recovery firmware. Shall not overlap with the UROT slot(USLOT).</description>
                        <addressOffset>0x0000</addressOffset>
                        <access>read-write</access>
                        <size>0x20</size>
                        <fields>
                          <field>
                            <name>ADDR</name>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <enumeratedValues>
                              <enumeratedValue>
                                <name>Undefined</name>
                                <description>The slot is not defined.</description>
                                <value>0xFFFFFFFF</value>
                              </enumeratedValue>
                            </enumeratedValues>
                          </field>
                        </fields>
                      </register>
                      <register>
                        <name>MAX</name>
                        <description>Maximum size of the recovery image in bytes.</description>
                        <addressOffset>0x0004</addressOffset>
                        <access>read-write</access>
                        <size>0x20</size>
                        <fields>
                          <field>
                            <name>SIZE</name>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <enumeratedValues>
                              <enumeratedValue>
                                <name>Undefined</name>
                                <description>The slot is not defined.</description>
                                <value>0xFFFFFFFF</value>
                              </enumeratedValue>
                            </enumeratedValues>
                          </field>
                        </fields>
                      </register>
                    </cluster>
                  </cluster>
                  <cluster>
                    <name>FW</name>
                    <description>FW verified by the secure domain ROM code.</description>
                    <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_FW</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0018</addressOffset>
                    <register>
                      <name>SIZE</name>
                      <description>The firmware size (in bytes). Shall not exceed the max defined
              limits for USLOT in case of UROT firmware.Shall not exceed the max
              defined limits for USLOT in case of UROT firmware.</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <description>Firmware size</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The FW is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>ADDR</name>
                      <description>Address of the firmware verified by the secure domain
              ROM code.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <description>Firmware address</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The FW is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
