ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
                    <register>
                      <name>TIMESTAMP</name>
                      <description>Unsigned 32-bit integer timestamp of the firmware in Unix time used to prevent
               downgrade of firmware on firmware update.</description>
                      <addressOffset>0x0058</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>Unsigned unix-time timestamp of the firmware</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The FW timestamp is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>PARTNO</name>
                      <description>Part-number for which the firmware is built. Must match
               the part number in OICR region.</description>
                      <addressOffset>0x005C</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>Part number of the device for which the firmware is built.</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The part number is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <cluster>
                    <name>POLICY</name>
                    <description>Set various policies on related to the firmware verification and
            update.</description>
                    <headerStructName>RICR_UROT_UPWD_UPDATE_SM_TBS_POLICY</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0078</addressOffset>
                    <register>
                      <name>UPDATE</name>
                      <description>Enable or Disable firmware update.</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register.</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                  on update is left unchanged.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable firmware update.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable firmware update.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>REVOKE</name>
                      <description>Configure key revocation policy.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                   on auto-revocation is left unchanged.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable auto-revocation of keys.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable auto-revocation of keys used to verify firmware.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>DGPREV</name>
                      <description>Configure the downgrade prevention policy.</description>
                      <addressOffset>0x0008</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable downgrade protection on firmware update.
                  If Enabled, the SM.TBS.FW.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SM.TBS.FW.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <dim>0x5</dim>
                      <dimIncrement>0x4</dimIncrement>
                      <name>RFU[%s]</name>
                      <description>Description collection: These registers are included when generating signature of the TBS content of SM.</description>
                      <addressOffset>0x000C</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>RFU</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The register is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <register>
                    <dim>0x10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>CIPHERDIGEST[%s]</name>
                    <description>Description collection: SHA2-512 digest of the AES-GCM AAD, IV and encrypted firmware.</description>
                    <addressOffset>0x0098</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>SHA2-512 Digest value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>Encrypted firmware digest, unprogrammed if the FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SM</description>
                    <addressOffset>0x00D8</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>SIGNATURE</name>
                  <description>Signature on the manifest defined in TBS</description>
                  <headerStructName>RICR_UROT_UPWD_UPDATE_SM_SIGNATURE</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x00F4</addressOffset>
                  <register>
                    <name>ALG</name>
                    <description>The signature algorithm identifier as defined in RFC8152.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ID</name>
                        <description>Algorithm identifier</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature algorithm identifier is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>AlgIdEd25519</name>
                            <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                            <value>0x00000005</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>SIZE</name>
                    <description>Size of the raw signature in bytes.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Signature size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>SizeEd25519</name>
                            <description>Size of Ed25519 signature bytestring.</description>
                            <value>0x00000040</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>MaxSize</name>
                            <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                            <value>0x00000040</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the signature on the firmware manifest.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Signature address.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
            </cluster>
            <register>
              <dim>0x10</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: SHA-512 Digest of the signed manifest used for integrity check of the
          signed-manifest.</description>
              <addressOffset>0x0120</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
            </register>
            <register>
              <name>STATE</name>
              <description>Internal state of any update.</description>
              <addressOffset>0x0160</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
            </register>
          </cluster>
          <cluster>
            <name>STATE</name>
            <description>Describes the currently booted firmware (UROT or recovery) and if the
        update of the two firmwares is currently enabled or disabled.</description>
            <headerStructName>RICR_UROT_STATE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x04A4</addressOffset>
            <register>
              <name>CURRENTFW</name>
              <description>Indicate which of the firmware, UROT or recovery, is started.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>MRAM location of either UROT or recovery firmware based on which
            firmware is started at cold boot. This address is updated by the ROM
            code and cold boot and used at warm boot to start the right firmware.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprogrammed</name>
                      <description>The address is not programmed.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>UROTFWUPDATE</name>
              <description>Indicates if UROT firmware update is enabled or disabled.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>ROM writes this field based on whether a valid recovery firmware
            exists and reads this field to process any request to update the
            UROT firmware.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>The update of UROT is disabled since no valid recovery firmware
                exists.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>The update of UROT is enabled since valid recovery firmware
                exists.</description>
                      <value>0x83A91C27</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RECOVERYFWUPDATE</name>
              <description>Indicates if recovery firmware update is enabled or disabled.</description>
              <addressOffset>0x0008</addressOffset>
              <access>read-write</access>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>ROM writes this field based on whether a valid UROT firmware
            exists and reads this field to process any request to update the
            recovery firmware.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>The update of recovery firmware is disabled since no valid UROT
                firmmware exists.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>The update of recovery firmware is enabled since valid UROT
                firmmware exists.</description>
                      <value>0x83A91C27</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
