ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for APPLICATION.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for APPLICATION.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x34</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_APPLICATION_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for APPLICATION.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>RADIOCORE</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_RADIOCORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x310</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for RADIOCORE.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for RADIOCORE.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x34</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>RADIO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_RADIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x48</addressOffset>
              <cluster>
                <name>SPHYNXANA</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>FSCTRL0</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FSCTRL1</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FSCTRL2</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RXCTRL</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>OVRRXTRIMCODE</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>RXAGC</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_RADIO_RXAGC</headerStructName>
                <access>read-write</access>
                <addressOffset>0x14</addressOffset>
                <register>
                  <name>CALIBRATION</name>
                  <description>RADIOCORE.RADIO.RXAGC.CALIBRATION</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>PVTTOT</name>
                <description>Trim value for RADIOCORE.RADIO.PVTTOT</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>KDTC</name>
                <description>Trim value for RADIOCORE.RADIO.KDTC</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>TXHFGAIN</name>
                <description>Trim value for RADIOCORE.RADIO.TXHFGAIN</description>
                <addressOffset>0x20</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>PVTTOFIX</name>
                <description>Trim value for RADIOCORE.RADIO.PVTTOFIX</description>
                <addressOffset>0x24</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>LOOPGAIN</name>
                <description>Trim value for RADIOCORE.RADIO.ADPLLTRIMCOMMAND0</description>
                <addressOffset>0x28</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>VREG1V80V8</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_VREG1V80V8</headerStructName>
            <access>read-write</access>
            <addressOffset>0x384</addressOffset>
            <cluster>
              <name>TRIM</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_VREG1V80V8_TRIM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>IREF</name>
                <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.IREF</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>HIGHPOWER</name>
                <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.HIGHPOWER</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>LOWPOWER</name>
                <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.LOWPOWER</description>
                <addressOffset>0x8</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>ULPR</name>
                <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.ULPR</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>AUDIOPLL</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_AUDIOPLL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x394</addressOffset>
            <cluster>
              <name>TRIM</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_AUDIOPLL_TRIM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>CTUNE</name>
                <description>Trim value for SYSCTRL.AUDIOPLL.TRIM.CTUNE</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>AUDIOPLLPM</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_AUDIOPLLPM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x398</addressOffset>
            <cluster>
              <name>TRIM</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_AUDIOPLLPM_TRIM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>VREFPM</name>
                <description>Trim value for SYSCTRL.AUDIOPLLPM.TRIM.VREFPM</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>USBHSPLL</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_USBHSPLL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x39C</addressOffset>
            <cluster>
              <name>TRIM</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_USBHSPLL_TRIM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>CTUNE</name>
                <description>Trim value for SYSCTRL.USBHSPLL.TRIM.CTUNE</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
