ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for WIFICORE.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x00C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_WIFICORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x010</addressOffset>
              <cluster>
                <dim>22</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>REPAIR[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_WIFICORE_MEMCONF_REPAIR</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>BITLINE</name>
                  <description>Description cluster: Value for WIFICORE.MEMCONF.REPAIR[n].BITLINE</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Repair value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>30</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x058</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for WIFICORE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>RADIO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_WIFICORE_RADIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0E0</addressOffset>
              <register>
                <name>BIAS2G4</name>
                <description>Bias trim values for 2.4GHz operation</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>PGABIAS</name>
                    <description>Trim value PGA bias generator</description>
                    <lsb>0</lsb>
                    <msb>3</msb>
                  </field>
                  <field>
                    <name>DABIAS</name>
                    <description>Trim value DA bias generator</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>PABIAS</name>
                    <description>Trim value PA bias generator</description>
                    <lsb>8</lsb>
                    <msb>11</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>BIAS5G</name>
                <description>Bias trim values for 5GHz operation</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>PGABIAS</name>
                    <description>Trim value PGA bias generator</description>
                    <lsb>0</lsb>
                    <msb>3</msb>
                  </field>
                  <field>
                    <name>DABIAS</name>
                    <description>Trim value DA bias generator</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>PABIAS</name>
                    <description>Trim value PA bias generator</description>
                    <lsb>8</lsb>
                    <msb>11</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>LNAGAINMAPPING[%s]</name>
                <description>Description collection: Mapping of LNA gain index to gain in dB</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>GAIN</name>
                    <description>Gain value in dB for LNA index n</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFTRIMSPARE[%s]</name>
                <description>Description collection: Arbitrary RF register trim</description>
                <addressOffset>0x028</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value to apply</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>ADDRESS</name>
                    <description>Register address to apply trim value to. Address 0x3FFF indicates unused trim value.</description>
                    <lsb>8</lsb>
                    <msb>21</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>GRAPHICS</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_GRAPHICS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x680</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GRAPHICS_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GRAPHICS_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for GRAPHICS.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>COARSE</name>
                  <description>Trim value for GRAPHICS.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FINE</name>
                  <description>Trim value for GRAPHICS.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x008</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for GRAPHICS.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x00C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GRAPHICS_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x010</addressOffset>
              <cluster>
                <dim>12</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GRAPHICS_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for GRAPHICS.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>AUXPLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GRAPHICS_AUXPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x040</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GRAPHICS_AUXPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for GRAPHICS.AUXPLL.CTUNE</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGGFX</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GRAPHICS_VREGGFX</headerStructName>
              <access>read-write</access>
              <addressOffset>0x044</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GRAPHICS_VREGGFX_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for GRAPHICS.VREGGFX.IREF</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for GRAPHICS.VREGGFX.HIGHPOWER</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for GRAPHICS.VREGGFX.LOWPOWER</description>
                  <addressOffset>0x008</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULPR</name>
                  <description>Trim value for GRAPHICS.VREGGFX.ULPR</description>
                  <addressOffset>0x00C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>ML</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_ML</headerStructName>
            <access>read-write</access>
            <addressOffset>0x6E0</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_ML_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_ML_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for ML.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for ML.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for ML.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x01C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for ML.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x034</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_ML_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x038</addressOffset>
              <cluster>
                <dim>3</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_ML_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for ML.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>BOOT</name>
          <description>Unspecified</description>
          <headerStructName>FICR_BOOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x8A0</addressOffset>
          <register>
            <name>SIZE</name>
            <description>Size of DATA group</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Number of trim values stored in DATA.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0xC0</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Compressed address and data pointer.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REGOFFSET</name>
                <description>Address offset to trim register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DATAPOINTER</name>
                <description>Pointer to location in TRIM group</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
