ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
        <register>
          <name>ITATBDATA0</name>
          <description>Integration Test ATB Data Register 0</description>
          <addressOffset>0xEEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATDATASBIT0</name>
              <description>Read the value of ATDATAS[0] input to TMC</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ATDATASBIT7</name>
              <description>Read the value of ATDATAS[7] input to TMC</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ATDATASBIT15</name>
              <description>Read the value of ATDATAS[15] input to TMC</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ATDATASBIT23</name>
              <description>Read the value of ATDATAS[23] input to TMC</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ATDATASBIT31</name>
              <description>Read the value of ATDATAS[31] input to TMC</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ATDATASBIT39</name>
              <description>Read the value of ATDATAS[39] input to TMC</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ATDATASBIT47</name>
              <description>Read the value of ATDATAS[47] input to TMC</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>ATDATASBIT55</name>
              <description>Read the value of ATDATAS[55] input to TMC</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ATDATASBIT63</name>
              <description>Read the value of ATDATAS[63] input to TMC</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>ATDATASBIT71</name>
              <description>Read the value of ATDATAS[71] input to TMC</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>ATDATASBIT79</name>
              <description>Read the value of ATDATAS[79] input to TMC</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>ATDATASBIT87</name>
              <description>Read the value of ATDATAS[87] input to TMC</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ATDATASBIT95</name>
              <description>Read the value of ATDATAS[95] input to TMC</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ATDATASBIT103</name>
              <description>Read the value of ATDATAS[103] input to TMC</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>ATDATASBIT111</name>
              <description>Read the value of ATDATAS[111] input to TMC</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>ATDATASBIT119</name>
              <description>Read the value of ATDATAS[119] input to TMC</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ATDATASBIT127</name>
              <description>Read the value of ATDATAS[127] input to TMC</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR2</name>
          <description>Integration Test ATB Control 2 Register</description>
          <addressOffset>0xEF0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATREADYS</name>
              <description>Set the value of ATREADYS output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFVALIDS</name>
              <description>Set the value of AFVALIDS output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>SYNCREQS</name>
              <description>Set the value of SYNCREQS output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR1</name>
          <description>Integration Test ATB Control 1 Register</description>
          <addressOffset>0xEF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATIDS</name>
              <description>Read the value of ATIDS input to TMC</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR0</name>
          <description>Integration Test ATB Control 0 Register</description>
          <addressOffset>0xEF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALIDS</name>
              <description>Read the value of ATVALIDS input to TMC</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFREADYS</name>
              <description>Read the value of AFREADYS input to TMC</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ATBYTESS</name>
              <description>Read the value of ATBYTESS input to TMC</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTEGRATION_MODE</name>
              <description>Allows the component to switch from functional mode to integration mode or back.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set Register</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>This claim tag bit is implemented</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear Register</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>The value present reflects the current setting of the Claim Tag.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>Lock Access Register</description>
          <addressOffset>0xFB0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS_W</name>
              <description>A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than 0xC5ACCE55 will have the affect of removing write access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKEXIST</name>
              <description>Indicates that a lock control mechanism exists for this device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>LOCKGRANT</name>
              <description>Returns the current status of the Lock.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>LOCKTYPE</name>
              <description>Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>This component implements a 32-bit Lock Access Register</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHSTATUS</name>
          <description>Authentication Status Register</description>
          <addressOffset>0xFB8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NSID</name>
              <description>Indicates the security level for non-secure invasive debug</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Functionality disabled. This return value occurs when DBGEN is LOW.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Functionality enabled. This return value occurs when DBGEN is HIGH.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSNID</name>
              <description>Indicates the security level for non-secure non-invasive debug</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Functionality not implemented or controlled elsewhere.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SID</name>
              <description>Indicates the security level for secure invasive debug</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Functionality disabled. This return value occurs when DBGEN is LOW or SPIDEN is LOW.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Functionality enabled. This return value occurs when DBGEN and SPIDEN are HIGH.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNID</name>
              <description>Indicates the security level for secure non-invasive debug</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Functionality not implemented or controlled elsewhere.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>Device Configuration Register</description>
          <addressOffset>0xFC8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000300</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATBINPORTCOUNT</name>
              <description>This value indicates the type/number of ATB multiplexing present on the input ATB.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CLKSCHEME</name>
              <description>This value indicates the TMC RAM clocking scheme used, ie. whether the TMC RAM operates synchronously or asynchronously to CLK.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>The TMC RAM operates synchronously to CLK.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONFIGTYPE</name>
              <description>This value indicates TMC configuration type.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ETB</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETR</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETF</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMWIDTH</name>
              <description>This value indicates the width of the Memory interface databus.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>Memory interface databus is 32 bits wide.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64BIT</name>
                  <description>Memory interface databus is 64 bits wide.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128BIT</name>
                  <description>Memory interface databus is 128 bits wide.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256BIT</name>
                  <description>Memory interface databus is 256 bits wide.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WBUF_DEPTH</name>
              <description>This value indicates, in powers of two, the number of entries in the Write buffer. Each entry is of size ATB_DATA_WIDTH.</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4ENTRIES</name>
                  <description>Depth of the Write buffer is 4 entries.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8ENTRIES</name>
                  <description>Depth of the Write buffer is 8 entries.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16ENTRIES</name>
                  <description>Depth of the Write buffer is 16 entries.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32ENTRIES</name>
                  <description>Depth of the Write buffer is 32 entries.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>Device Type Identifier Register</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000021</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAJOR_TYPE</name>
              <description>Major classification grouping for this debug/trace component</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINK</name>
                  <description>This component is a trace sink.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUB_TYPE</name>
              <description>Sub-classification within the major category</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <description>This component captures the trace data into RAM that can be drained through APB.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>JEP106_CONT</name>
              <description>JEDEC continuation code indicating the designer of the component (along with the identity code)</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>FOURKB_COUNT</name>
              <description>This is a 4-bit value that indicates the total contiguous size of the memory window used by this component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID0</name>
          <description>Peripheral ID0 Register</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000061</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_NUMBER_BITS7TO0</name>
              <description>Bits [7:0] of the component's part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID1</name>
          <description>Peripheral ID1 Register</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B9</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_NUMBER_BITS11TO8</name>
              <description>Bits [11:8] of the component's part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>JEP106_BITS3TO0</name>
              <description>Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the continuation code)</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>JEP106_BITS6TO4</name>
              <description>Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the continuation code)</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always set. Indicates that a JEDEC assigned value is used</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>The Revision field is an incremental value starting at 0x0 for the first design of this component. This only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the exact major/minor revision.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
