ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
            <cluster>
              <name>INTRESETEN</name>
              <description>Trigger a reset when tamper is detected by the glitch detectors, signal protector or CRACEN tamper detector.</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_INTRESETEN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x478</addressOffset>
              <register>
                <name>CTRL</name>
                <description>Control register for internal tamper reset enable signal.</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000011</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Set value of internal tamper reset enable signal.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Low</name>
                        <description>Signal is logic 0.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>High</name>
                        <description>Signal is logic 1.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <access>writeonce</access>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Lock disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Lock enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FAULTTEST</name>
                    <description>Injects a fault in the protected signal.</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <access>write-only</access>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NoOperation</name>
                        <description>No operation.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Trigger</name>
                        <description>Trigger fault.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>WRITEPROTECTION</name>
                    <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Read: Write protection is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Read: Write protection is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Clear</name>
                        <description>Write: Value to clear write protection.</description>
                        <value>0xF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>KEY</name>
                    <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                    <access>write-only</access>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>KEY</name>
                        <description>Write key value.</description>
                        <value>0x50FA</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>STATUS</name>
                <description>Status register for internal tamper reset enable signal.</description>
                <addressOffset>0x004</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ERROR</name>
                    <description>Error detection status.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NoError</name>
                        <description>No error detected.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Error</name>
                        <description>Error detected.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x004</dimIncrement>
            <name>FEATURE[%s]</name>
            <description>Unspecified</description>
            <headerStructName>TAMPC_PROTECT_FEATURE</headerStructName>
            <alternateCluster>STRUCT0</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Description cluster: Control register for protect feature n.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of protect feature n.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FAULTTEST</name>
                  <description>Injects a fault in the protected signal.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoOperation</name>
                      <description>No operation.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger fault.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
