ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>LOCKRANGE[%s]</name>
            <description>Description collection: LOCKRANGE trim values for operation points</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCKRANGELOWN</name>
                <description>Lock range low boundary for VNW biased devices.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>LOCKRANGEHIGHN</name>
                <description>Lock range high boundary for VNW biased devices.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>LOCKRANGELOWP</name>
                <description>Lock range low boundary for VPW biased devices.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>LOCKRANGEHIGHP</name>
                <description>Lock range high boundary for VPW biased devices.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PVTMONCYCLES[%s]</name>
            <description>Description collection: PVTMONCYCLES trim values for operation points</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>These bits configure the internal monitor</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MODE</name>
          <description>ABB control</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPPOINT</name>
              <description>The ABB operating point.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the operating point automatically based on request from the
                    master ABB controller.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V4</name>
                  <description>Force the operating point to 0.4V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V5</name>
                  <description>Force the operating point to 0.5V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V6</name>
                  <description>Force the operating point to 0.6V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V8</name>
                  <description>Force the operating point to 0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABBEN</name>
              <description>Enable ABB.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the ABB enable automatically based on request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Force enable ABB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Force disable ABB</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>ABB_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>LOCKED</name>
            <description>Override the LOCKED signal from the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUSVALID</name>
            <description>Override the STATUS_VALID signal from the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
