ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="IPCT_NS">
      <name>IPCT_S</name>
      <description>IPCT APB registers 1</description>
      <baseAddress>0x51013000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT_0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>IPCT_1</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SWI0_NS</name>
      <description>Software interrupt 0</description>
      <baseAddress>0x42058000</baseAddress>
      <headerStructName>SWI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SWI0</name>
        <value>88</value>
      </interrupt>
      <groupName>SWI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI1_NS</name>
      <description>Software interrupt 1</description>
      <baseAddress>0x42059000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI1</name>
        <value>89</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI2_NS</name>
      <description>Software interrupt 2</description>
      <baseAddress>0x4205A000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI2</name>
        <value>90</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI3_NS</name>
      <description>Software interrupt 3</description>
      <baseAddress>0x4205B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI3</name>
        <value>91</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI4_NS</name>
      <description>Software interrupt 4</description>
      <baseAddress>0x4205C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI4</name>
        <value>92</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI5_NS</name>
      <description>Software interrupt 5</description>
      <baseAddress>0x4205D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI5</name>
        <value>93</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI6_NS</name>
      <description>Software interrupt 6</description>
      <baseAddress>0x4205E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI6</name>
        <value>94</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0_NS">
      <name>SWI7_NS</name>
      <description>Software interrupt 7</description>
      <baseAddress>0x4205F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>SWI7</name>
        <value>95</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>BELLBOARD_NS</name>
      <description>BELLBOARD APB registers 0</description>
      <baseAddress>0x4F099000</baseAddress>
      <headerStructName>BELLBOARD</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BELLBOARD_0</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_1</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_2</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_3</name>
        <value>99</value>
      </interrupt>
      <groupName>BELLBOARD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_TRIGGER[%s]</name>
          <description>Description collection: Task TRIGGER[n]</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TRIGGER</name>
              <description>Task TRIGGER[n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_TRIGGERED[%s]</name>
          <description>Description collection: Event TRIGGERED[n]</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_TRIGGERED</name>
              <description>Event TRIGGERED[n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
