ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
          <register>
            <name>INTMSK0</name>
            <description>Configures masks for the sources of interrupts that affect the INT_ST0 register. Write 1 to un-mask each error report.</description>
            <addressOffset>0x0C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKACKWITHERR0</name>
                <description>Mask for ack_with_err_0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASKACKWITHERR1</name>
                <description>Mask for ack_with_err_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MASKACKWITHERR2</name>
                <description>Mask for ack_with_err_2</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MASKACKWITHERR3</name>
                <description>Mask for ack_with_err_3</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MASKACKWITHERR4</name>
                <description>Mask for ack_with_err_4</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>MASKACKWITHERR5</name>
                <description>Mask for ack_with_err_5</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>MASKACKWITHERR6</name>
                <description>Mask for ack_with_err_6</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>MASKACKWITHERR7</name>
                <description>Mask for ack_with_err_7</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MASKACKWITHERR8</name>
                <description>Mask for ack_with_err_8</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>MASKACKWITHERR9</name>
                <description>Mask for ack_with_err_9</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>MASKACKWITHERR10</name>
                <description>Mask for ack_with_err_10</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>MASKACKWITHERR11</name>
                <description>Mask for ack_with_err_11</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>MASKACKWITHERR12</name>
                <description>Mask for ack_with_err_12</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>MASKACKWITHERR13</name>
                <description>Mask for ack_with_err_13</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>MASKACKWITHERR14</name>
                <description>Mask for ack_with_err_14</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>MASKACKWITHERR15</name>
                <description>Mask for ack_with_err_15</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MASKDPHYERRORS0</name>
                <description>Mask for dphy_errors_0</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>MASKDPHYERRORS1</name>
                <description>Mask for dphy_errors_1</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>MASKDPHYERRORS2</name>
                <description>Mask for dphy_errors_2</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>MASKDPHYERRORS3</name>
                <description>Mask for dphy_errors_3</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>MASKDPHYERRORS4</name>
                <description>Mask for dphy_errors_4</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSK1</name>
            <description>Configures masks for the sources of interrupts that affect the INT_ST1 register.</description>
            <addressOffset>0x0C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKTOHSTX</name>
                <description>Mask for to_hs_tx</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASKTOLPRX</name>
                <description>Mask for to_lp_rx</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MASKECCSINGLEERR</name>
                <description>Mask for ecc_single_err</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MASKECCMULTPLERR</name>
                <description>Mask for ecc_multpl_err</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MASKCRCERR</name>
                <description>Mask for crc_err</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>MASKPKTSIZEERR</name>
                <description>Mask for pkt_size_err</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>MASKEOPTERR</name>
                <description>Mask for eopt_err</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>MASKDPIPLDWRERR</name>
                <description>Mask for dpi_pld_wr_err</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MASKGENCMDWRERR</name>
                <description>Mask for gen_cmd_wr_err</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>MASKGENPLDWRERR</name>
                <description>Mask for gen_pld_wr_err</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>MASKGENPLDSENDERR</name>
                <description>Mask for gen_pld_send_err</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>MASKGENPLDRDERR</name>
                <description>Mask for gen_pld_rd_err</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>MASKGENPLDRECEVERR</name>
                <description>Mask for gen_pld_recev_err</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>MASKDBICMDWRERR</name>
                <description>Mask for dbi_cmd_wr_err</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>MASKDBIPLDWRERR</name>
                <description>Mask for dbi_pld_wr_err</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>MASKDBIPLDRDERR</name>
                <description>Mask for dbi_pld_rd_err</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MASKDBIPLDRECVERR</name>
                <description>Mask for dbi_pld_recv_err</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>MASKDBIILEGALCOMMERR</name>
                <description>Mask for dbi_ilegal_comm_err</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>MASKDPIBUFFPLDUNDER</name>
                <description>Mask for dpi_buff_pld_under</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYCAL</name>
            <description>Controls the skew calibration of D-PHY.</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXSKEWCALHS</name>
                <description>High-speed skew calibration is started when txskewcalhs is set high (assuming that PHY is in Stop state).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCE0</name>
            <description>Forces interrupt that affect the INT_ST0 register.</description>
            <addressOffset>0x0D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCEACKWITHERR0</name>
                <description>Force ack_with_err_0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR1</name>
                <description>Force ack_with_err_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR2</name>
                <description>Force ack_with_err_2</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR3</name>
                <description>Force ack_with_err_3</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR4</name>
                <description>Force ack_with_err_4</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR5</name>
                <description>Force ack_with_err_5</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR6</name>
                <description>Force ack_with_err_6</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR7</name>
                <description>Force ack_with_err_7</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR8</name>
                <description>Force ack_with_err_8</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR9</name>
                <description>Force ack_with_err_9</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR10</name>
                <description>Force ack_with_err_10</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR11</name>
                <description>Force ack_with_err_11</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR12</name>
                <description>Force ack_with_err_12</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR13</name>
                <description>Force ack_with_err_13</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR14</name>
                <description>Force ack_with_err_14</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>FORCEACKWITHERR15</name>
                <description>Force ack_with_err_15</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FORCEDPHYERRORS0</name>
                <description>Force dphy_errors_0</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>FORCEDPHYERRORS1</name>
                <description>Force dphy_errors_1</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>FORCEDPHYERRORS2</name>
                <description>Force dphy_errors_2</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>FORCEDPHYERRORS3</name>
                <description>Force dphy_errors_3</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>FORCEDPHYERRORS4</name>
                <description>Force dphy_errors_4</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCE1</name>
            <description>Forces interrupts that affect the INT_ST1 register.</description>
            <addressOffset>0x0DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCETOHSTX</name>
                <description>Force to_hs_tx</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FORCETOLPRX</name>
                <description>Force to_lp_rx</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FORCEECCSINGLEERR</name>
                <description>Force ecc_single_err</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>FORCEECCMULTPLERR</name>
                <description>Force ecc_multpl_err</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FORCECRCERR</name>
                <description>Force crc_err</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>FORCEPKTSIZEERR</name>
                <description>Force pkt_size_err</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FORCEEOPTERR</name>
                <description>Force eopt_err</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FORCEDPIPLDWRERR</name>
                <description>Force dpi_pld_wr_err</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>FORCEGENCMDWRERR</name>
                <description>Force gen_cmd_wr_err</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>FORCEGENPLDWRERR</name>
                <description>Force gen_pld_wr_err</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>FORCEGENPLDSENDERR</name>
                <description>Force gen_pld_send_err</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>FORCEGENPLDRDERR</name>
                <description>Force gen_pld_rd_err</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>FORCEGENPLDRECEVERR</name>
                <description>Force gen_pld_recev_err</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>FORCEDBICMDWRERR</name>
                <description>Force dbi_cmd_wr_err.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>FORCEDBIPLDWRERR</name>
                <description>Force dbi_pld_wr_err.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>FORCEDBIPLDRDERR</name>
                <description>Force dbi_pld_rd_err.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FORCEDBIPLDRECVERR</name>
                <description>Force dbi_pld_recv_err.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>FORCEDBIILEGALCOMMERR</name>
                <description>Force dbi_ilegal_comm_err.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>FORCEDPIBUFFPLDUNDER</name>
                <description>Force for dpi_buff_pld_under.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSCPARAMETER</name>
            <description>Configures Display Stream Compression.</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COMPRESSIONMODE</name>
                <description>When set to 1, this bit enables the compression mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>COMPRESSALGO</name>
                <description>This field indicates the algorithm identifier:</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ALGO0</name>
                    <description>VESA DSC Standard 1.1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALGO1</name>
                    <description>reserved, not used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALGO2</name>
                    <description>reserved, not used</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALGO3</name>
                    <description>vendor-specific algorithm</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PPSSEL</name>
                <description>This field indicates the  PPS selector:</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PPSSEL0</name>
                    <description>PPS Table 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PPSSEL1</name>
                    <description>PPS Table 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PPSSEL2</name>
                    <description>PPS Table 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PPSSEL3</name>
                    <description>PPS Table 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTMRRDCFG</name>
            <description>Configures times related to PHY to perform some operations in lane byte clock cycles.</description>
            <addressOffset>0x0F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXRDTIME</name>
                <description>This field configures the maximum time required to perform a read command in lane byte clock cycles. This register can only be modified when no read command is in progress.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
