ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
          <register>
            <name>GPUTEX0FSTRIDE</name>
            <description>Image 0 Mode and Stride</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specifies the image stride distance in bytes from one scanline to another (signed)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MODE</name>
                <description>Specifies the image mode (applicable only for Textures not for Framebuffer)</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>GPUTEX0POS17LEN01</name>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>WRAP</name>
                <description>Specifies the image wrapping mode (applicable only for Textures not for Framebuffer).</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TILE</name>
                <description>Enables the Tile Mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUTEX0POS21LEN02</name>
                <lsb>21</lsb>
                <msb>22</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RADFILL</name>
                <description>Radial fill enable</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Specifies the image format</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DITH</name>
                <description>If set for destination texture, enables color dithering.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX0RESXY</name>
            <description>Image 0 Resolution</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESX</name>
                <description>Specifies the size of resolution X</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESY</name>
                <description>Specifies the size of resolution Y</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX1BASE</name>
            <description>Base address of drawing surface 1.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASE</name>
                <description>Specifies the base address or drawing surface 1.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX1FSTRIDE</name>
            <description>Image 1 Mode and Stride</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specifies the image stride distance in bytes from one scanline to another (signed)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MODE</name>
                <description>Specifies the image mode (applicable only for Textures not for Framebuffer)</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>GPUTEX1POS17LEN01</name>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>WRAP</name>
                <description>Specifies the image wrapping mode (applicable only for Textures not for Framebuffer).</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TILE</name>
                <description>Enables the Tile Mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUTEX1POS21LEN02</name>
                <lsb>21</lsb>
                <msb>22</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RADFILL</name>
                <description>Radial fill enable</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Specifies the image format</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DITH</name>
                <description>If set for destination texture, enables color dithering.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX1RESXY</name>
            <description>Image 1 Resolution</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESX</name>
                <description>Specifies the size of resolution X</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESY</name>
                <description>Specifies the size of resolution Y</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEXCOLOR</name>
            <description>Texture Map's default color (for use with Luminance and Alpha-only color formats)</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX2BASE</name>
            <description>Base address of drawing surface 2.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASE</name>
                <description>Specifies the base address or drawing surface 2.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX2FSTRIDE</name>
            <description>Image 2 Mode and Stride</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specifies the image stride distance in bytes from one scanline to another (signed)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MODE</name>
                <description>Specifies the image mode (applicable only for Textures not for Framebuffer)</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>GPUTEX2POS17LEN01</name>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>WRAP</name>
                <description>Specifies the image wrapping mode (applicable only for Textures not for Framebuffer).</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TILE</name>
                <description>Enables the Tile Mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUTEX2POS21LEN02</name>
                <lsb>21</lsb>
                <msb>22</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RADFILL</name>
                <description>Radial fill enable</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Specifies the image format</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DITH</name>
                <description>If set for destination texture, enables color dithering.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX2RESXY</name>
            <description>Image 2 Resolution</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESX</name>
                <description>Specifies the size of resolution X</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESY</name>
                <description>Specifies the size of resolution Y</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX3BASE</name>
            <description>Base address of drawing surface 3.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASE</name>
                <description>Specifies the base address or drawing surface 3.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX3FSTRIDE</name>
            <description>Image 3 Mode and Stride</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specifies the image stride distance in bytes from one scanline to another (signed)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MODE</name>
                <description>Specifies the image mode (applicable only for Textures not for Framebuffer)</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>GPUTEX3POS17LEN01</name>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>WRAP</name>
                <description>Specifies the image wrapping mode (applicable only for Textures not for Framebuffer).</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TILE</name>
                <description>Enables the Tile Mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUTEX3POS21LEN02</name>
                <lsb>21</lsb>
                <msb>22</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RADFILL</name>
                <description>Radial fill enable</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Specifies the image format</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DITH</name>
                <description>If set for destination texture, enables color dithering.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX3RESXY</name>
            <description>Image 3 Resolution</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESX</name>
                <description>Specifies the size of resolution X</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESY</name>
                <description>Specifies the size of resolution Y</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTSCNEWBLOCKTRIG</name>
            <description>Trigger to reset TSc block.</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS00LEN32</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTSCNEWBLOCKSEL</name>
            <description>Select how TSc block will be reset.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEL</name>
                <description>0: Reset TSc block when NEMA_DRAW_CMD_NOHOLD is written or tesselator starts new geometry or NEMA_TSC_NEW_BLOCK_TRIG is written.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>POS02LEN01</name>
                <lsb>2</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBREAKPOINT</name>
            <description>Debug feature. Specifies a Breakpoint on the Command List</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUBREAKPOINT</name>
                <description>Specifies the Breakpoint ID</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBREAKPOINTMASK</name>
            <description>Debug feature. Specifies a Breakpoint Mask.</description>
            <addressOffset>0x08C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASK</name>
                <description>Specifies the Breakpoint Mask</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCGCMD</name>
            <description>Enable Clock gating</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCGCMDSTOP</name>
                <description>When set to 1, the clock stops</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GPUCGCMDPOS01LEN30</name>
                <lsb>1</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
