ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
          <register>
            <name>ADMASAHIGHR</name>
            <description>This register holds the upper 32-bit system address for the DMA transfer. This register is applicable for an SD/eMMC/UHS-II mode.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADMASAHIGH</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETINITR</name>
            <description>Unspecified</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_INIT_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETDSR</name>
            <description>Unspecified</description>
            <addressOffset>0x062</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_DS_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETHSR</name>
            <description>Unspecified</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_HS_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETSDR12R</name>
            <description>Unspecified</description>
            <addressOffset>0x066</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_SDR12_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETSDR25R</name>
            <description>Unspecified</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_SDR25_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETSDR50R</name>
            <description>Unspecified</description>
            <addressOffset>0x06A</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_SDR50_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETSDR104R</name>
            <description>Unspecified</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_SDR104_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESETDDR50R</name>
            <description>Unspecified</description>
            <addressOffset>0x06E</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of the PRESET_DDR50_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <description>Driver Strength Select Value</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
