ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM120_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x5F8E6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM120_UARTE120</name>
        <value>230</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE120_S</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x5F8E6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM120_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM120_UARTE120</name>
        <value>230</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x4F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x5F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM122_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x4F8E8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM122</name>
        <value>232</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM122_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 5</description>
      <baseAddress>0x5F8E8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM122</name>
        <value>232</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM123_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 6</description>
      <baseAddress>0x4F8E9000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM123</name>
        <value>233</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM123_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 7</description>
      <baseAddress>0x5F8E9000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM123</name>
        <value>233</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPU000_S">
      <name>SPU130_S</name>
      <description>System protection unit 11</description>
      <baseAddress>0x5F900000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU130</name>
        <value>256</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="MPC000_S">
      <name>MPC130_S</name>
      <description>Memory Privilege Controller 5</description>
      <baseAddress>0x5F901000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>MPC130</name>
        <value>257</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR120_NS">
      <name>GLOBAL_VPR130_NS</name>
      <description>VPR peripheral registers 4</description>
      <baseAddress>0x4F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR120_NS">
      <name>GLOBAL_VPR130_S</name>
      <description>VPR peripheral registers 5</description>
      <baseAddress>0x5F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPU000_S">
      <name>SPU131_S</name>
      <description>System protection unit 12</description>
      <baseAddress>0x5F920000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU131</name>
        <value>288</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_NS</name>
      <description>IPCT APB registers 2</description>
      <baseAddress>0x4F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_S</name>
      <description>IPCT APB registers 3</description>
      <baseAddress>0x5F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC130_NS</name>
      <description>Distributed programmable peripheral interconnect controller 2</description>
      <baseAddress>0x4F922000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
