ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>CH[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SAADC_CH</headerStructName>
          <access>read-write</access>
          <addressOffset>0x510</addressOffset>
          <register>
            <name>PSELP</name>
            <description>Description cluster: Input positive pin selection for CH[n]</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>GPIO pin selection.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>GPIO port selection</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>INTERNAL</name>
                <description>Internal input selection for Analog positive input when CH[n].PSELP.CONNECT = Internal</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal0</name>
                    <description>Connected to VDD_AO_1V8</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Interna1</name>
                    <description>Connected to VDD_AO_0V8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal2</name>
                    <description>Connected to VDD_IO_1V2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal3</name>
                    <description>Reserved for future use</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TEST</name>
                <description>Test input selection for Analog positive input when CH[n].PSELP.CONNECT = Test</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATB2</name>
                    <description>ATB2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVSS</name>
                    <description>AVSS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference, voltage determined by PADC_REFSEL</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>30</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput</name>
                    <description>Select analog input</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Selects internal inputs.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Test</name>
                    <description>Selects test inputs.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PSELN</name>
            <description>Description cluster: Input negative pin selection for CH[n]</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>GPIO pin selection.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>GPIO Port selection</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>INTERNAL</name>
                <description>Internal input selection for Analog negative input when CH[n].PSELN.CONNECT = Internal</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal4</name>
                    <description>Connected to VDD_1V0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal5</name>
                    <description>Connected to VDD_PPA_1V6 (Halti only)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal6</name>
                    <description>Connected to VDD_AO_5V0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal7</name>
                    <description>Reserved for future use</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TEST</name>
                <description>Test input selection for Analog negative input when CH[n].PSELN.CONNECT = Test</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATB0</name>
                    <description>ATB0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVSS</name>
                    <description>AVSS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference, voltage determined by PADC_REFSEL</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>30</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput</name>
                    <description>Select analog input</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Selects internal inputs.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Test</name>
                    <description>Selects test inputs.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Input configuration for CH[n]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GAIN</name>
                <description>Gain control</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Gain2_3</name>
                    <description>2/3</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1</name>
                    <description>1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain2</name>
                    <description>2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain4</name>
                    <description>4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1_2</name>
                    <description>1/2</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURST</name>
                <description>Enable burst mode</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Burst mode is disabled (normal operation)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as fast as it can, and sends the average to Data RAM.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REFSEL</name>
                <description>Reference control</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Internal reference (1.024 V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>External reference given at PADC_EXT_REF_1V2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Enable differential mode</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SE</name>
                    <description>Single ended, PSELN will be ignored, negative input to ADC shorted to GND</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Diff</name>
                    <description>Differential</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TACQ</name>
                <description>Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is ((TACQ+1) x 125 ns)</description>
                <lsb>16</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>TCONV</name>
                <description>Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns)</description>
                <lsb>28</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIMIT</name>
            <description>Description cluster: High/low limits for event monitoring a channel</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF8000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOW</name>
                <description>Low level limit</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>High level limit</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>REGRESULT</name>
          <description>Last conversion result</description>
          <addressOffset>0x5EC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGRESULT</name>
              <description>Result of the previous ADC conversion</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLUTION</name>
          <description>Resolution configuration</description>
          <addressOffset>0x5F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Set the resolution</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8 bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10bit</name>
                  <description>10 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12bit</name>
                  <description>12 bit</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14bit</name>
                  <description>14 bit</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16bit</name>
                  <description>16 bit</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERSAMPLE</name>
          <description>Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used.</description>
          <addressOffset>0x5F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVERSAMPLE</name>
              <description>Oversample control</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over2x</name>
                  <description>Oversample 2x</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over4x</name>
                  <description>Oversample 4x</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over8x</name>
                  <description>Oversample 8x</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over16x</name>
                  <description>Oversample 16x</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over32x</name>
                  <description>Oversample 32x</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over64x</name>
                  <description>Oversample 64x</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over128x</name>
                  <description>Oversample 128x</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over256x</name>
                  <description>Oversample 256x</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over512x</name>
                  <description>Oversample 512x</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over1024x</name>
                  <description>Oversample 1024x</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over2048x</name>
                  <description>Oversample 2048x</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over4096x</name>
                  <description>Oversample 4096x</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLERATE</name>
          <description>Controls normal or continuous sample rate</description>
          <addressOffset>0x5F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Capture and compare value. Sample rate is 16 MHz/CC</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Select mode for sample rate control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Task</name>
                  <description>Rate is controlled from SAMPLE task</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timers</name>
                  <description>Rate is controlled from local timer (use CC to control the rate)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCRMREQ</name>
          <description>PCRM request for clean power</description>
          <addressOffset>0x5FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>REQ</name>
              <description>Request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Request disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RESULT</name>
          <description>RESULT EasyDMA channel</description>
          <headerStructName>GLOBAL_SAADC_RESULT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x628</addressOffset>
          <register>
            <name>DMAENABLE</name>
            <description>This register has no other function than defining the value on the dmaChannelPeripheralEnable output. (which is not connected)</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable DMA</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
