ankuns/nrfx/bsp/stable/mdk/nrf7140_secure.svd
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM131_NS</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 2</description>
      <baseAddress>0x4F9B7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM131</name>
        <value>439</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM131_S</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 3</description>
      <baseAddress>0x5F9B7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM131</name>
        <value>439</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPU000_S">
      <name>SPU136_S</name>
      <description>System protection unit 17</description>
      <baseAddress>0x5F9C0000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU136</name>
        <value>448</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC135_NS</name>
      <description>Distributed programmable peripheral interconnect controller 12</description>
      <baseAddress>0x4F9C1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC135_S</name>
      <description>Distributed programmable peripheral interconnect controller 13</description>
      <baseAddress>0x5F9C1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER134_NS</name>
      <description>Timer/Counter 12</description>
      <baseAddress>0x4F9C2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER134</name>
        <value>450</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER134_S</name>
      <description>Timer/Counter 13</description>
      <baseAddress>0x5F9C2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER134</name>
        <value>450</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER135_NS</name>
      <description>Timer/Counter 14</description>
      <baseAddress>0x4F9C3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER135</name>
        <value>451</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER135_S</name>
      <description>Timer/Counter 15</description>
      <baseAddress>0x5F9C3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER135</name>
        <value>451</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM132_NS</name>
      <description>Pulse width modulation unit 6</description>
      <baseAddress>0x4F9C4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM132</name>
        <value>452</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM132_S</name>
      <description>Pulse width modulation unit 7</description>
      <baseAddress>0x5F9C4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM132</name>
        <value>452</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM134_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 16</description>
      <baseAddress>0x4F9C5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS134_NS</name>
      <description>SPI Slave 10</description>
      <baseAddress>0x4F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM134_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 8</description>
      <baseAddress>0x4F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS134_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 8</description>
      <baseAddress>0x4F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE134_NS</name>
      <description>UART with EasyDMA 10</description>
      <baseAddress>0x4F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM134_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 17</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS134_S</name>
      <description>SPI Slave 11</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM134_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 9</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS134_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 9</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE134_S</name>
      <description>UART with EasyDMA 11</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM135_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 18</description>
      <baseAddress>0x4F9C6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS135_NS</name>
      <description>SPI Slave 12</description>
      <baseAddress>0x4F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM135_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 10</description>
      <baseAddress>0x4F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS135_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 10</description>
      <baseAddress>0x4F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE135_NS</name>
      <description>UART with EasyDMA 12</description>
      <baseAddress>0x4F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM135_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 19</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS135_S</name>
      <description>SPI Slave 13</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM135_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 11</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS135_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 11</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE135_S</name>
      <description>UART with EasyDMA 13</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
